tap "bro3886/tap", "https://github.com/BRO3886/homebrew-tap", trusted: true
# Automatic configure script builder
brew "autoconf"
# Cross-platform make
brew "cmake"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Your feedback loop with the agent: review plans and code locally
brew "crit"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# Play, record, convert, and stream audio and video
brew "ffmpeg@7", link: true
# Collection of GNU find, xargs, and locate
brew "findutils"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Git extension for versioning large files
brew "git-lfs"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# CLI for Drive, Gmail, Calendar, Sheets, Docs, Chat, Admin, and more
brew "googleworkspace-cli"
# Ping, but with a graph
brew "gping"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Swiss-army knife of markup format conversion
brew "pandoc"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Rsync for cloud storage
brew "rclone"
# CLI proxy to minimize LLM token consumption
brew "rtk"
# SOcket CAT: netcat on steroids
brew "socat"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Blazing fast CLI for macOS Reminders — sub-200ms reads and writes via EventKit
brew "bro3886/tap/rem-cli"
# Anthropic's official Claude AI desktop app
cask "claude"
# OpenJDK distribution from Amazon
cask "corretto@17"
# Web browser
cask "google-chrome"
# Native desktop AI assistant from Google
cask "google-gemini"
# Code notebooks for Elixir developers
cask "livebook"
# Clipboard manager
cask "maccy"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Plugin for AWS CLI to start and end sessions that connect to managed instances
cask "session-manager-plugin"
# Open-source code editor
cask "visual-studio-code"
# Network protocol analyzer
cask "wireshark-app"
# Yet another monitor
cask "yam-display"
# Video communication and virtual meeting platform
cask "zoom"
